Trial1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
(0 0 0)			// Vertex 0
(144 0 0)	        // Vertex 1
(72 72 0)	        // Vertex 2
(21.0883 50.9116 0)	// Vertex 3
(122.9116 50.9116 0)    // Vertex 4
(72 0 0)                // Vertex 5
(0 0 1)			// Vertex 6
(144 0 1)	        // Vertex 7
(72 72 1)	        // Vertex 8
(21.0883 50.9116 1)	// Vertex 9
(122.9116 50.9116 1)    // Vertex 10
(72 0 1)                // Vertex 11
);

blocks
(
hex (2 0 5 2 8 6 11 8)      (20 20 1)  simpleGrading  (1 1 1)
hex (2 5 1 2 8 11 7 8)     (20 20 1)  simpleGrading  (1 1 1)
); 

edges
(
	arc 0 2   (21.0833 50.9116 0)
	arc 6 8   (21.0833 50.9116 1)
	arc 2 1   (122.9116 50.9116 0)
	arc 8 7   (122.9116 50.9116 1)
);

boundary
(
	Lower
	{
		type wall;
		faces
		(
			(0 5 11 6)
			(5 1 7 11)
		);
	}

	Upper
	{
		type wall;
		faces
		(
			(0 2 8 6)
			(2 1 7 8)
		);
	}


        //frontWedge
        //{ 
              //  type empty;
              //  faces  
               // (
	                //(0 2 5)
	                //(5 1 2)
                        
               // );
       // }

        //backWedge
        //{ 
               // type empty;
               // faces  
               // (
                //        (6 11 8)
                //        (11 7 8)
               // );
      //  }

);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
