Trial1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       1540;
    }
    Upper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       1580;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1600;
        startFace       1620;
    }
)

// ************************************************************************* //
