Trial1/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
boundary
{
    defaultFaces 
    {
        type        empty;
    }

}
// U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        defaultFaces
        {
            type            empty;
        }


        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
	

    }
}

T
{
    internalField   uniform 294;

    boundaryField
    {
        defaultFaces
        {
            type            empty;
        }

        ".*"
        {
            type            zeroGradient;
            value           uniform 294;
        }


        heatSource_to_region1
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 294;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        defaultFaces
        {
            type            empty;
        }

        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        defaultFaces
        {
            type            empty;
        }

        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 0;

    boundaryField
    {
        defaultFaces
        {
            type            empty;
        }

        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 0;
        }
    }
}

p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }

        defaultFaces
        {
            type            empty;
        }
    }
}

// ************************************************************************* //
